# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

set1 = set("2 4 6 8 10 12 10 8 6 4 2".split())
set2 = set("3 6 9 12 15 18".split())

print("Общие элементы: ", set1.intersection(set2))
print("Уникальные элементы в наборе 1: ", set1.difference(set2))
print("Уникальные элементы в наборе 2: ", set2.difference(set1))

